;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; AHK版本：		1.0.48.5
; 语言：		中文
; 适用平台：	WinXp/NT
; 作者：		海盗 <healthlolicon@gmail.com>
; 脚本类型：	辅助软件
; 脚本功能：	EVE T1科技船插制造材料计算
;
; 已知缺陷：
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;~ #NoTrayIcon
TP=
(
装甲改装件
航天技术改装件
无人机改装件
电子设备改装件
电子压制改装件
能源栅格改装件
能量武器改装件
混合武器改装件
导弹发射器改装件
射弹武器改装件
护盾改装件
)
TC1=
(
远程维修增效器
三角装甲聚合器
反电磁聚合器
反爆破聚合器
反动能聚合器
反热能聚合器
辅助纳米聚合器
纳米机器人加速器
打捞回收工具
)
TC2=
(
辅助推进器
货柜舱优化改造
动态燃料控制阀
引擎热能防护装置
低摩擦喷嘴接口
超空间速度调节器
复合碳素引擎舱
跃迁核心优化系统
)
TC3=
(
停滞无人机增强设备
岗哨炮伤害增强设备
无人机增速装置
无人机巡航芯片
无人机控制范围扩大装置
无人机维修加速器
无人机耐用性增强装置
无人机采矿增量器
)
TC4=
(
信号干扰扩大装置
引力电容器升级
弥集进化演算法数据库
放射范围约束装置
水冷电子设备
)
TC5=
(
信号集中设备
反信号区域投射器
离子力场投射器
粒子散布投放器
粒子散布放大器
跟踪诊断子程序
锁定系统稳定器
锁定系统辅助控制器
)
TC6=
(
出口端口放大器
半导体记忆电池
电容器控制电路
能量栅格字程序优化器
辅助电源路由器
)
TC7=
(
冷凝能量管理单元
能量武器冲击加速器
能量武器发散调节装置
能量武器急转控制器
能量武器范围扩大设备
能量武器轨迹校准设备
能量武器释放过滤器
)
TC8=
(
冷凝混合管理单元
混合武器冲击加速器
混合武器射速调节装置
混合武器急转控制器
混合武器节能设备(释放过滤器)
混合武器范围扩大装置
混合武器轨迹校准设备
)
TC9=
(
弹体装卸加速装置
弹头加热辅助系统
弹头强化辅助系统
弹头爆燃辅助系统
液压舱推进器
火箭燃料缓冲隔离装置
)
TC10=
(
射弹武器冲击加速器
射弹武器射速调节装置
射弹武器急转控制器
射弹武器范围扩大装置
射弹武器轨迹校准设备
)
TC11=
(
抗动能屏障强化器
抗热能屏障强化器
抗爆破屏障强化器
抗电磁屏障强化器
核心防御力场扩张装置
核心防御力场稳固装置
核心防御操控稳定装置
核心防御电容器安全管理装置
核心防御节能装置
)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
M=
(
受污染的纳米聚合体
被污染的洛伦兹流体
烧毁的遥感探测处理器
出故障的护盾发射器
有故障的电力泵
损毁的触发机关
缠绕的能量管道
三钛合金条
装甲附甲板
损坏的无人机调制器
损坏的人工神经网络
堆砌的能源电路
烧毁的逻辑电路
烧焦的微电路
烧焦的接口电路
推进装置控制台
短路的电容器控制台
聚合导体
防御控制台
)
Loop,Parse,M,`n,`r
	M%a_index%:=A_LoopField
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; 小型装甲
N_P1_1_1=1,2;9,3;15,3
N_P1_1_2=1,2;9,3;15,3
N_P1_1_3=1,2;9,3;15,3
N_P1_1_4=1,2;9,3;15,3
N_P1_1_5=1,2;9,3;15,3
N_P1_1_6=1,2;9,3;15,3
N_P1_1_7=1,3;9,4;15,4
N_P1_1_8=1,3;9,4;15,4
N_P1_1_9=1,3;9,4;15,4
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; 中型装甲
N_P2_1_1=1,13;9,18;15,20
N_P2_1_2=1,11;9,14;15,17
N_P2_1_3=1,9;9,14;15,17
N_P2_1_4=1,9;9,14;15,17
N_P2_1_5=1,9;9,14;15,17
N_P2_1_6=1,9;9,14;15,17
N_P2_1_7=1,13;9,18;15,20
N_P2_1_8=1,13;9,18;15,20
N_P2_1_9=1,13;9,18;15,20
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; 大型装甲
N_P3_1_1=1,66;9,88;15,93
N_P3_1_2=1,55;9,72;15,83
N_P3_1_3=1,44;9,72;15,83
N_P3_1_4=1,44;9,72;15,83
N_P3_1_5=1,44;9,72;15,83
N_P3_1_6=1,44;9,72;15,83
N_P3_1_7=1,66;9,88;15,99
N_P3_1_8=1,66;9,88;15,99
N_P3_1_9=1,66;9,88;15,99
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; 小型航天
N_P1_2_1=14,3;13,4;16,1
N_P1_2_2=15,6;12,3;8,4
N_P1_2_3=13,1;8,1;12,2
N_P1_2_4=15,3;8,2;12,3
N_P1_2_5=14,3;13,4;16,1
N_P1_2_6=16,3;14,3;13,4
N_P1_2_7=15,4;12,3;8,4
N_P1_2_8=14,3;13,4;16,3
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; 中型航天
N_P2_2_1=16,7;14,18;13,20
N_P2_2_2=8,22;12,15;15,26
N_P2_2_3=8,4;12,11;13,7
N_P2_2_4=8,13;12,14;15,17
N_P2_2_5=16,7;14,18;13,20
N_P2_2_6=16,15;14,15;13,23
N_P2_2_7=8,22;12,15;15,24
N_P2_2_8=16,14;14,15;13,22
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; 大型航天
N_P3_2_1=16,33;14,88;13,99
N_P3_2_2=8,110;12,75;15,130
N_P3_2_3=8,22;12,55;13,33
N_P3_2_4=8,66;12,72;15,83
N_P3_2_5=16,33;14,88;13,99
N_P3_2_6=16,79;14,78;13,116
N_P3_2_7=8,110;12,77;15,123
N_P3_2_8=16,69;14,78;13,109
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;小型无人机
N_P1_3_1=13,6;12,6;10,4
N_P1_3_2=13,4;12,4;10,4
N_P1_3_3=13,3;14,3;10,3
N_P1_3_4=10,2;13,3;14,3
N_P1_3_5=10,2;13,3;14,3
N_P1_3_6=13,3;12,3;10,2
N_P1_3_7=13,4;12,4;10,3
N_P1_3_8=13,4;12,4;10,3
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;中型无人机
N_P2_3_1=12,26;10,23;13,25
N_P2_3_2=12,23;10,21;13,23
N_P2_3_3=10,18;13,17;14,14
N_P2_3_4=10,9;13,17;14,14
N_P2_3_5=10,9;13,17;14,14
N_P2_3_6=12,14;10,9;13,17
N_P2_3_7=12,22;10,18;13,22
N_P2_3_8=12,22;10,19;13,22
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;大型无人机
N_P3_3_1=12,133;10,114;13,127
N_P3_3_2=12,116;10,103;13,113
N_P3_3_3=10,88;13,83;14,72
N_P3_3_4=10,44;13,83;14,72
N_P3_3_5=10,44;14,72;13,83
N_P3_3_6=12,72;10,44;13,83
N_P3_3_7=12,110;10,88;13,110
N_P3_3_8=12,110;10,94;13,110
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;小型电子设备
N_P1_4_1=11,3;18,1;12,3
N_P1_4_2=14,3;15,4;11,2
N_P1_4_3=14,4;11,3;18,2
N_P1_4_4=12,4;11,3;18,2
N_P1_4_5=14,4;11,3;18,2
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;中型电子设备
N_P2_4_1=12,18;11,15;18,7
N_P2_4_2=11,13;14,18;15,20
N_P2_4_3=11,18;18,9;14,22
N_P2_4_4=12,22;11,18;18,9
N_P2_4_5=11,18;18,9;14,22
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;大型电子设备
N_P3_4_1=12,88;11,77;18,33
N_P3_4_2=11,66;14,88;15,99
N_P3_4_3=11,88;18,44;14,110
N_P3_4_4=12,110;11,88;18,44
N_P3_4_5=11,88;18,44;14,110
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;小型电子压制
N_P1_5_1=14,2;13,2;11,3
N_P1_5_2=15,4;11,2;12,3
N_P1_5_3=14,4;13,4;11,3
N_P1_5_4=14,3;15,4;11,2
N_P1_5_5=15,3;11,2;12,3
N_P1_5_6=15,4;14,3;11,2
N_P1_5_7=14,4;13,4;11,3
N_P1_5_8=14,4;13,4;11,3
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;中型电子压制
N_P2_5_1=11,18;13,13;14,11
N_P2_5_2=12,18;11,13;15,20
N_P2_5_3=11,18;13,22;14,22
N_P2_5_4=11,13;15,20;14,18
N_P2_5_5=12,14;11,9;15,17
N_P2_5_6=11,13;15,20;14,18
N_P2_5_7=11,18;13,22;14,22
N_P2_5_8=11,18;13,22;14,22
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;大型电子压制
N_P3_5_1=11,88;13,66;14,55
N_P3_5_2=12,88;11,66;15,99
N_P3_5_3=11,88;13,110;14,110
N_P3_5_4=11,66;15,99;14,88
N_P3_5_5=12,72;11,44;15,83
N_P3_5_6=11,66;15,99;14,88
N_P3_5_7=11,88;14,110;13,110
N_P3_5_8=11,88;13,110;14,110
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;小型能源栅格
N_P1_6_1=7,2;15,3;12,3
N_P1_6_2=12,7;13,7;17,2
N_P1_6_3=17,1;13,3;12,3
N_P1_6_4=12,3;7,2;15,3
N_P1_6_5=7,2;13,10;12,10
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;中型能源栅格
N_P2_6_1=12,14;15,17;7,9
N_P2_6_2=12,33;13,33;17,11
N_P2_6_3=12,14;13,17;17,4
N_P2_6_4=12,14;15,17;7,9
N_P2_6_5=12,52;7,13;13,50
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;大型能源栅格
N_P3_6_1=12,72;15,83;7,44
N_P3_6_2=12,165;13,165;17,55
N_P3_6_3=12,72;13,83;17,22
N_P3_6_4=12,72;15,83;7,44
N_P3_6_5=12,259;7,66;13,248
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;小型能量武器
N_P1_7_1=15,4;14,3;5,3
N_P1_7_2=14,3;15,6;5,4
N_P1_7_3=14,3;15,6;5,4
N_P1_7_4=14,3;15,4;5,2
N_P1_7_5=14,3;15,4;5,2
N_P1_7_6=14,3;15,4;5,2
N_P1_7_7=14,2;15,2;5,1
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;中型能量武器
N_P2_7_1=5,18;14,18;15,22
N_P2_7_2=5,23;14,18;15,28
N_P2_7_3=5,20;14,18;15,25
N_P2_7_4=5,13;14,18;15,20
N_P2_7_5=5,13;14,18;15,20
N_P2_7_6=5,13;14,18;15,20
N_P2_7_7=5,4;14,11;15,11
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;大型能量武器
N_P3_7_1=5,88;14,88;15,110
N_P3_7_2=5,114;14,88;15,136
N_P3_7_3=5,101;14,88;15,125
N_P3_7_4=5,66;14,88;15,99
N_P3_7_5=5,66;14,88;15,99
N_P3_7_6=5,66;14,88;15,99
N_P3_7_7=5,22;14,55;15,55
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;小型混合武器
N_P1_8_1=14,3;15,4;2,3
N_P1_8_2=14,3;15,6;2,4
N_P1_8_3=14,3;15,6;2,4
N_P1_8_4=14,3;15,4;2,2
N_P1_8_5=14,2;15,2;2,1
N_P1_8_6=14,3;15,4;2,2
N_P1_8_7=14,3;15,4;2,2
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;中型混合武器
N_P2_8_1=2,18;15,22;14,18
N_P2_8_2=2,23;15,28;14,18
N_P2_8_3=2,20;15,25;14,18
N_P2_8_4=2,13;15,20;14,18
N_P2_8_5=2,4;15,11;14,11
N_P2_8_6=2,13;15,20;14,18
N_P2_8_7=2,13;15,20;14,18
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;大型混合武器
N_P3_8_1=2,88;15,110;14,88
N_P3_8_2=2,114;15,136;14,88
N_P3_8_3=2,101;15,125;14,88
N_P3_8_4=2,66;15,99;14,88
N_P3_8_5=2,22;14,55;15,55
N_P3_8_6=2,66;15,99;14,88
N_P3_8_7=2,66;15,99;14,88
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;小型导弹
N_P1_9_1=3,4;13,6;12,3
N_P1_9_2=3,4;13,6;12,3
N_P1_9_3=3,2;13,4;12,4
N_P1_9_4=3,2;13,4;12,3
N_P1_9_5=3,2;13,4;12,4
N_P1_9_6=3,2;13,4;12,4
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;中型导弹
N_P2_9_1=12,18;13,25;3,20
N_P2_9_2=12,18;13,28;3,23
N_P2_9_3=12,22;13,22;3,9
N_P2_9_4=12,18;13,20;3,13
N_P2_9_5=12,22;13,22;3,9
N_P2_9_6=12,22;13,22;3,12
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;大型导弹
N_P3_9_1=12,88;13,125;3,101
N_P3_9_2=12,88;13,136;3,114
N_P3_9_3=12,110;13,110;3,44
N_P3_9_4=12,88;13,99;3,66
N_P3_9_5=12,110;13,110;3,44
N_P3_9_6=12,110;13,110;3,58
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;小型弹射
N_P1_10_1=14,3;6,4;15,6
N_P1_10_2=14,3;6,4;15,6
N_P1_10_3=14,3;6,2;15,4
N_P1_10_4=14,3;6,2;15,4
N_P1_10_5=14,3;6,2;15,4
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;中型弹射
N_P2_10_1=14,18;6,23;15,28
N_P2_10_2=14,18;6,20;15,25
N_P2_10_3=14,18;6,13;15,20
N_P2_10_4=14,18;6,13;15,20
N_P2_10_5=14,18;6,13;15,20
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;大型弹射
N_P3_10_1=14,88;15,136;6,114
N_P3_10_2=14,88;15,125;6,101
N_P3_10_3=14,88;15,99;6,66
N_P3_10_4=14,88;15,99;6,66
N_P3_10_5=14,88;15,99;6,66
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;小型护盾
N_P1_11_1=4,2;14,3;15,3
N_P1_11_2=4,2;14,3;15,3
N_P1_11_3=4,2;14,3;15,3
N_P1_11_4=4,2;14,3;15,3
N_P1_11_5=12,4;13,4;19,2
N_P1_11_6=12,4;13,4;19,2
N_P1_11_7=12,4;13,4;19,2
N_P1_11_8=4,1;14,2;15,2
N_P1_11_9=4,1;14,3;15,3
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;中型护盾
N_P2_11_1=4,9;15,17;14,14
N_P2_11_2=4,9;15,17;14,14
N_P2_11_3=4,9;15,17;14,14
N_P2_11_4=4,9;15,17;14,14
N_P2_11_5=12,22;19,9;13,22
N_P2_11_6=12,22;19,9;13,22
N_P2_11_7=12,22;19,9;13,22
N_P2_11_8=4,4;15,13;14,11
N_P2_11_9=4,7;15,14;14,15
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;大型护盾
N_P3_11_1=4,44;15,83;14,72
N_P3_11_2=4,44;15,83;14,72
N_P3_11_3=4,44;15,83;14,72
N_P3_11_4=4,44;15,83;14,72
N_P3_11_5=12,110;19,44;13,110
N_P3_11_6=12,110;19,44;13,110
N_P3_11_7=12,110;19,44;13,110
N_P3_11_8=4,22;14,55;15,66
N_P3_11_9=4,33;15,72;14,77
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
loop,19
	Now_%A_index%=0
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
Gui, Add, TreeView,r20 x6 y31 w170 h340 gMyTree
Loop,3
{
	a:=a_index
	if a=1
		P%a%:=TV_Add("小型")
	Else if a=2
		P%a%:=TV_Add("中型")
	Else
		P%a%:=TV_Add("大型")
	loop,Parse,TP,`n,`r
	{
		b:=a_index
		P%a%_%b%:=TV_Add(A_LoopField,P%a%)
			loop,parse,TC%b%,`n,`r
				P%a%_%b%_%a_index%:=TV_Add(A_LoopField,P%a%_%b%)
	}
}

Skill=5
Research=0
Gui, Add, ListView, x185 y31 w300 h340 -Hdr vMyLV,1|2|3
LV_ModifyCol(1,130)
LV_ModifyCol(2,98)
LV_ModifyCol(3,68)
Gui, Add, Text, x16 y8 w75  , 生产效率学：
Gui, Add, DropDownList, x96 y3 w35 vSkill gSkill, |1|2|3|4|5||
Gui, Add, Text, x196 y8 w90 , 材料研究次数：
Gui, Add, Edit, x291 y3 w40 vResearch gResearch,0
Gui, Add, UpDown,Range0-100, UpDown
Gui, Add, Button, x394 y3 w90 h25  gNow, 现有材料
Gui, Show,h377 w490,T1船插制造
Return

Skill:
GuiControlGet,Skill
Gosub,Show
Return
Research:
GuiControlGet,Research
if Research=
	Research=0
Gosub,Show
Return

Now:
Gui,2:+Owner1
Gui +Disabled
Gui,2: Add, Text, x6 y11 w130 h20 , %M1%
Gui,2: Add, Text, x236 y11 w130 h20 , %M2%
Gui,2: Add, Text, x6 y41 w130 h20 , %M3%
Gui,2: Add, Text, x236 y41 w130 h20 , %M4%
Gui,2: Add, Text, x6 y71 w130 h20 , %M5%
Gui,2: Add, Text, x236 y71 w130 h20 , %M6%
Gui,2: Add, Text, x6 y101 w130 h20 , %M7%
Gui,2: Add, Text, x236 y101 w130 h20 , %M8%
GUI,2: Add, Text, x6 y131 w130 h20 , %M9%
GUI,2: Add, Text, x236 y131 w130 h20 , %M10%
GUI,2: Add, Text, x6 y161 w130 h20 , %M11%
GUI,2: Add, Text, x236 y161 w130 h20 , %M12%
GUI,2: Add, Text, x6 y191 w130 h20 , %M12%
GUI,2: Add, Text, x236 y191 w130 h20 , %M14%
GUI,2: Add, Text, x6 y221 w130 h20 , %M15%
GUI,2: Add, Text, x236 y221 w130 h20 , %M16%
GUI,2: Add, Text, x6 y251 w130 h20 , %M17%
GUI,2: Add, Text, x236 y251 w130 h20 , %M18%
GUI,2: Add, Text, x6 y281 w130 h20 , %M19%
GUI,2: Add, Edit, x146 y11 w70 h20 gsubmit vNow_1, %Now_1%
GUI,2: Add, Edit, x376 y11 w70 h20 gsubmit vNow_2, %Now_2%
GUI,2: Add, Edit, x146 y41 w70 h20 gsubmit vNow_3, %Now_3%
GUI,2: Add, Edit, x376 y41 w70 h20 gsubmit vNow_4, %Now_4%
GUI,2: Add, Edit, x146 y71 w70 h20 gsubmit vNow_5, %Now_5%
GUI,2: Add, Edit, x376 y71 w70 h20 gsubmit vNow_6, %Now_6%
GUI,2: Add, Edit, x146 y101 w70 h20 gsubmit vNow_7, %Now_7%
GUI,2: Add, Edit, x376 y101 w70 h20 gsubmit vNow_8, %Now_8%
GUI,2: Add, Edit, x146 y131 w70 h20 gsubmit vNow_9, %Now_9%
GUI,2: Add, Edit, x376 y131 w70 h20 gsubmit vNow_10, %Now_10%
GUI,2: Add, Edit, x146 y161 w70 h20 gsubmit vNow_11, %Now_11%
GUI,2: Add, Edit, x376 y161 w70 h20 gsubmit vNow_12, %Now_12%
GUI,2: Add, Edit, x146 y191 w70 h20 gsubmit vNow_13, %Now_13%
GUI,2: Add, Edit, x376 y191 w70 h20 gsubmit vNow_14, %Now_14%
GUI,2: Add, Edit, x146 y221 w70 h20 gsubmit vNow_15, %Now_15%
GUI,2: Add, Edit, x376 y221 w70 h20 gsubmit vNow_16, %Now_16%
GUI,2: Add, Edit, x146 y251 w70 h20 gsubmit vNow_17, %Now_17%
GUI,2: Add, Edit, x376 y251 w70 h20 gsubmit vNow_18, %Now_18%
GUI,2: Add, Edit, x146 y281 w70 h20 gsubmit vNow_19, %Now_19%
WinGetPos,X,Y,,,T1船插制造
X+=215
Y+=95
GUI,2: Show, h314 w457 x%X% y%Y%, 现有打捞材料数量
Return

Submit:
loop,19
	GuiControlGet,Now_%A_index%,2:
Gosub,show
Return

2GuiClose:
2GuiEscape:
Gui,1:-Disabled
Gui,2:destroy
Return

MyTree:
if A_GuiEvent <> S
    return
if TV_GetChild(A_EventInfo)<>0
	Return
Select=0
loop,3
{
	a:=A_Index
	loop,11
	{
		b:=A_Index
		loop,10
		{
			if P%a%_%b%_%a_index%=%A_EventInfo%
			{
				Select=P%a%_%b%_%a_index%
				Break
			}
		if Select<>0
			break
		}
	if Select<>0
		break
	}
}
Show:
LV_Delete()
if N_%Select%=
	Return
MaxResearch=0
MaxResearchY=0
loop,Parse,N_%Select%,;
{
	StringSplit,Material,A_LoopField,`,
	Your:=Round(Round(Material2/1.1)*((0.25*(5-Skill)/5)+1+0.1/(1+Research)))
	Your_:=Your . "个(你)"
	LV_Add("",M%Material1%,Round(Round(Material2/1.1)*(1+0.1/(1+Research))) . "个(理想的)",Your_)
	if a_index=1
		Min:=Floor(Now_%Material1%/Your)
	Min:=Min(Min,Floor(Now_%Material1%/Your))
	Loop
	{
		A:=Round(Material2/1.1)*(0.1/(1+A_index-1))
		if A<0.5
		{
			Times:=A_Index-1
			Break
		}
	}
	MaxResearch:=Max(MaxResearch,Times)
	Loop
	{
		B:=Round(Round(Material2/1.1)*((0.25*(5-Skill)/5)+0.1/(1+A_index-1)))-Round(Round(Material2/1.1)*((0.25*(5-Skill)/5)))
		if B=0
		{
			TimesY:=A_Index-1
			Break
			}
	}
	MaxResearchY:=Max(MaxResearchY,TimesY)
}
loop,3
	LV_Add("",A_Space,A_Space,A_Space)
LV_Add("","你能制造：" ,A_Space,Min . "个")
LV_Add("","无损次数：" ,A_Space,MaxResearch . "次")
LV_Add("","你的无损次数:" ,"(考虑技能)",MaxResearchY . "次")
Return


GuiClose:
ExitApp

Min(a,b)
{
	return, a<b ? a : b
}
Max(a,b)
{
	return, a>b ? a : b
	}